templates/media-content/version-1-1-0/get-media-content.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <GetMediaContentRequest xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/">
            <wsVersion xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{wsVersion}}
            </wsVersion>
            <id xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">{{username}}
            </id>
            <password xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{password}}
            </password>
            {% if cultureName is defined %}
            <cultureName xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">{{cultureName}}
            </cultureName>
            {% endif %}
            <mediaType xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">{{mediaType}}</mediaType>
            <productId xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{productId}}
            </productId>
        </GetMediaContentRequest>
    </soap-env:Body>
</soap-env:Envelope>
